Repository: Me-Shervs/Microblog
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: fil_ph

source: Please log in to access this page.
fil_ph: Mangyaring mag-log in upang ma-access ang pahinang ito.

source: [Microblog] Reset Your Password
fil_ph: [Microblog] I-reset ang Iyong Password

source: Remember Me
fil_ph: Tandaan Ako

source: Sign In
fil_ph: Mag-sign in

source: Repeat Password
fil_ph: Ulitin ang Password

source: Register
fil_ph: Magrehistro

source: Please use a different username.
fil_ph: Mangyaring gumamit ng ibang username.

source: Request Password Reset
fil_ph: Humiling ng Password Reset

source: Invalid username or password
fil_ph: Maling username o password

source: Congratulations, you are now a registered user!
fil_ph: Binabati kita, ikaw ay rehistradong user na!

source: Check your email for the instructions to reset your password
fil_ph: Tingnan ang iyong email para sa mga tagubilin sa pag-reset ng password

source: Your password has been reset.
fil_ph: Na-reset na ang iyong password.

source: About me
fil_ph: Tungkol sa akin

source: Submit
fil_ph: Isumite

source: Say something
fil_ph: May gustong sabihin

source: Your post is now live!
fil_ph: Live na ang iyong post!

source: Explore
fil_ph: Mag-explore

source: Your changes have been saved.
fil_ph: Nai-save na ang iyong mga pagbabago.

source: User %(username)s not found.
fil_ph: Hindi makita ang user na si %(username)s.

source: You cannot follow yourself!
fil_ph: Hindi mo maaaring i-follow ang iyong sarili!

source: You are following %(username)s!
fil_ph: Fino-follow mo na si %(username)s!

source: You cannot unfollow yourself!
fil_ph: Hindi mo maaaring i-unfollow ang iyong sarili!

source: %(username)s said %(when)s
fil_ph: Sinabi ni %(username)s %(when)s

source: Login
fil_ph: Mag-login

source: Logout
fil_ph: Mag-logout

source: Newer Posts
fil_ph: Mas Bagong Mga Post

source: Older Posts
fil_ph: Mas Lumang Mga Post

source: Last seen on:
fil_ph: Huling nakita noong:

source: %(count)d followers
fil_ph: %(count)d tagasunod

source: %(count)d following
fil_ph: %(count)d fina-follow

source: Edit your profile
fil_ph: I-edit ang iyong profile

source: Follow
fil_ph: I-follow

source: unfollow
fil_ph: I-unfollow

source: New User?
fil_ph: Bagong User?

source: Click to Register!
fil_ph: Magrehistro

source: Forgot Your Password?
fil_ph: I-reset ang Iyong Password

source: Click to Reset It
fil_ph: I-click para i-reset ito

source: 404 Not Found.
fil_ph: 404 Hindi Natagpuan.
